loadtest.yaml
config:
  target: "ws://localhost:8080"
  phases:
    - duration: 10
      arrivalRate: 3000
  ws:
    # Ignore SSL certificate errors
    # - useful in *development* with self-signed certs
    rejectUnauthorized: false
scenarios:
  - engine: "ws"
    flow:
      - send: "hello"
      - think: 1
      - send: "world"